In [10]:
%load_ext sql
%sql postgresql://postgres:root@localhost/SoleMateAI

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# ADMIN DASHBOARD

## CHARTS
### Statistic revenue, profit, capital by hour of a specific day

In [11]:
%sql \
WITH HourReference AS ( \
    SELECT 0 AS hour_of_day \
    UNION SELECT 1 UNION SELECT 2 UNION SELECT 3 \
    UNION SELECT 4 UNION SELECT 5 UNION SELECT 6 \
    UNION SELECT 7 UNION SELECT 8 UNION SELECT 9 \
    UNION SELECT 10 UNION SELECT 11 UNION SELECT 12 \
    UNION SELECT 13 UNION SELECT 14 UNION SELECT 15 \
    UNION SELECT 16 UNION SELECT 17 UNION SELECT 18 \
    UNION SELECT 19 UNION SELECT 20 UNION SELECT 21 \
    UNION SELECT 22 UNION SELECT 23 \
) \
SELECT \
    hr.hour_of_day AS time_point, \
    COALESCE(SUM(revenue_subquery.total_discounted_price), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    HourReference hr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o1.order_date) AS hour_of_day, \
        SUM(o1.total_discounted_price) AS total_discounted_price \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o1.order_date) \
) revenue_subquery ON hr.hour_of_day = revenue_subquery.hour_of_day \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o2.order_date) AS hour_of_day, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o2.order_date) \
) profit_subquery ON hr.hour_of_day = profit_subquery.hour_of_day \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o3.order_date) AS hour_of_day, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o3.order_date) \
) warehouse_subquery ON hr.hour_of_day = warehouse_subquery.hour_of_day \
GROUP BY \
    hr.hour_of_day \
ORDER BY \
    hr.hour_of_day;

 * postgresql://postgres:***@localhost/SoleMateAI
24 rows affected.

[(0, 0.0, 0.0, 0.0),
 (1, 0.0, 0.0, 0.0),
 (2, 0.0, 0.0, 0.0),
 (3, 0.0, 0.0, 0.0),
 (4, 0.0, 0.0, 0.0),
 (5, 0.0, 0.0, 0.0),
 (6, 0.0, 0.0, 0.0),
 (7, 0.0, 0.0, 0.0),
 (8, 0.0, 0.0, 0.0),
 (9, 0.0, 0.0, 0.0),
 (10, 0.0, 0.0, 0.0),
 (11, 22344000.0, 2501000.0, 19843000.0),
 (12, 0.0, 0.0, 0.0),
 (13, 31972000.0, 12213000.0, 19759000.0),
 (14, 0.0, 0.0, 0.0),
 (15, 0.0, 0.0, 0.0),
 (16, 19125000.0, 8074000.0, 11051000.0),
 (17, 0.0, 0.0, 0.0),
 (18, 0.0, 0.0, 0.0),
 (19, 0.0, 0.0, 0.0),
 (20, 0.0, 0.0, 0.0),
 (21, 0.0, 0.0, 0.0),
 (22, 0.0, 0.0, 0.0),
 (23, 0.0, 0.0, 0.0)]

### Statistic revenue, profit, capital by day of a specific month

In [12]:
%sql \
WITH RECURSIVE DayReference AS ( \
    SELECT 1 AS day_of_month \
    UNION ALL \
    SELECT day_of_month + 1 \
    FROM DayReference \
    WHERE day_of_month < EXTRACT(DAY FROM DATE_TRUNC('month', TO_DATE('05/2024', 'MM/YYYY')) + INTERVAL '1 month' - INTERVAL '1 day') \
) \
SELECT \
    dr.day_of_month AS time_point, \
    COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    DayReference dr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o1.order_date) AS day_of_month, \
        SUM(o1.total_discounted_price) AS total_revenue \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'MM/YYYY') = '05/2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o1.order_date) \
) revenue_subquery ON dr.day_of_month = revenue_subquery.day_of_month \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o2.order_date) AS day_of_month, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'MM/YYYY') = '05/2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o2.order_date) \
) profit_subquery ON dr.day_of_month = profit_subquery.day_of_month \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o3.order_date) AS day_of_month, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'MM/YYYY') = '05/2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o3.order_date) \
) warehouse_subquery ON dr.day_of_month = warehouse_subquery.day_of_month \
GROUP BY \
    dr.day_of_month \
ORDER BY \
    dr.day_of_month;

 * postgresql://postgres:***@localhost/SoleMateAI
31 rows affected.

[(1, 73441000.0, 22788000.0, 50653000.0),
 (2, 0.0, 0.0, 0.0),
 (3, 0.0, 0.0, 0.0),
 (4, 0.0, 0.0, 0.0),
 (5, 0.0, 0.0, 0.0),
 (6, 63630000.0, 38181000.0, 25449000.0),
 (7, 0.0, 0.0, 0.0),
 (8, 0.0, 0.0, 0.0),
 (9, 25900000.0, 17829000.0, 8071000.0),
 (10, 0.0, 0.0, 0.0),
 (11, 29928000.0, 10378000.0, 19550000.0),
 (12, 0.0, 0.0, 0.0),
 (13, 0.0, 0.0, 0.0),
 (14, 38045000.0, 28169000.0, 9876000.0),
 (15, 0.0, 0.0, 0.0),
 (16, 0.0, 0.0, 0.0),
 (17, 17153000.0, 6818000.0, 10335000.0),
 (18, 0.0, 0.0, 0.0),
 (19, 32192000.0, 11758000.0, 20434000.0),
 (20, 0.0, 0.0, 0.0),
 (21, 0.0, 0.0, 0.0),
 (22, 0.0, 0.0, 0.0),
 (23, 0.0, 0.0, 0.0),
 (24, 37589000.0, 12732000.0, 24857000.0),
 (25, 0.0, 0.0, 0.0),
 (26, 0.0, 0.0, 0.0),
 (27, 35055000.0, 4157000.0, 30898000.0),
 (28, 0.0, 0.0, 0.0),
 (29, 0.0, 0.0, 0.0),
 (30, 54016000.0, 25236000.0, 28780000.0),
 (31, 86607000.0, 45141000.0, 41466000.0)]

### Statistic revenue, profit, capital by month of a specific year

In [13]:
%sql \
WITH MonthReference AS ( \
    SELECT 1 AS month_of_year \
    UNION ALL \
    SELECT 2 UNION SELECT 3 UNION SELECT 4 \
    UNION SELECT 5 UNION SELECT 6 UNION SELECT 7 \
    UNION SELECT 8 UNION SELECT 9 UNION SELECT 10 \
    UNION SELECT 11 UNION SELECT 12 \
) \
SELECT \
    mr.month_of_year AS time_point, \
    COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    MonthReference mr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o1.order_date) AS month_of_year, \
        SUM(o1.total_discounted_price) AS total_revenue \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'YYYY') = '2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o1.order_date) \
) revenue_subquery ON mr.month_of_year = revenue_subquery.month_of_year \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o2.order_date) AS month_of_year, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'YYYY') = '2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o2.order_date) \
) profit_subquery ON mr.month_of_year = profit_subquery.month_of_year \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o3.order_date) AS month_of_year, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'YYYY') = '2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o3.order_date) \
) warehouse_subquery ON mr.month_of_year = warehouse_subquery.month_of_year \
GROUP BY \
    mr.month_of_year \
ORDER BY \
    mr.month_of_year;

 * postgresql://postgres:***@localhost/SoleMateAI
12 rows affected.

[(1, 0.0, 0.0, 0.0),
 (2, 0.0, 0.0, 0.0),
 (3, 0.0, 0.0, 0.0),
 (4, 160403000.0, 57099000.0, 103304000.0),
 (5, 493556000.0, 223187000.0, 270369000.0),
 (6, 270109000.0, 43560000.0, 226549000.0),
 (7, 0.0, 0.0, 0.0),
 (8, 0.0, 0.0, 0.0),
 (9, 0.0, 0.0, 0.0),
 (10, 0.0, 0.0, 0.0),
 (11, 0.0, 0.0, 0.0),
 (12, 0.0, 0.0, 0.0)]

## STATS
### Total revenue, profit, capital, item sold of a specific day

In [14]:
%sql \
WITH revenue_profit_warehouse AS ( \
    SELECT \
        COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
        COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
        COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
    FROM \
        ( \
            SELECT \
                SUM(o1.total_discounted_price) AS total_revenue \
            FROM \
                orders o1 \
            WHERE \
                TO_CHAR(o1.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o1.status = 'ORDER-DELIVERED' \
        ) revenue_subquery, \
        ( \
            SELECT \
                SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
            FROM \
                orders o2 \
            WHERE \
                TO_CHAR(o2.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o2.status = 'ORDER-DELIVERED' \
        ) profit_subquery, \
        ( \
            SELECT \
                SUM(o3.total_warehouse_price) AS total_warehouse_price \
            FROM \
                orders o3 \
            WHERE \
                TO_CHAR(o3.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o3.status = 'ORDER-DELIVERED' \
        ) warehouse_subquery \
) \
SELECT \
    rp.revenue_cost, \
    rp.profit_cost, \
    rp.warehouse_cost, \
    TO_CHAR(o.order_date, 'DD/MM/YYYY') AS selected_day, \
    SUM(o.total_item) AS total_items_sold \
FROM \
    orders o \
CROSS JOIN \
    revenue_profit_warehouse rp \
WHERE \
    TO_CHAR(o.order_date, 'DD/MM/YYYY') = '01/05/2024' \
    AND o.status = 'ORDER-DELIVERED' \
GROUP BY \
    TO_CHAR(o.order_date, 'DD/MM/YYYY'), \
    rp.revenue_cost, \
    rp.profit_cost, \
    rp.warehouse_cost \
ORDER BY \
    selected_day;

 * postgresql://postgres:***@localhost/SoleMateAI
1 rows affected.

[(73441000.0, 22788000.0, 50653000.0, '01/05/2024', 19)]

In [15]:
%sql SELECT order_date, status, updated_at, is_active, total_item, total_display_price, total_warehouse_price, total_discounted_price FROM orders LIMIT 10;

 * postgresql://postgres:***@localhost/SoleMateAI
10 rows affected.

[(datetime.datetime(2024, 4, 25, 15, 25, 45), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 25, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 7, 43628000.0, 20511000.0, 31423000.0),
 (datetime.datetime(2024, 4, 26, 8, 22, 52), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 26, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 9, 23617000.0, 19447000.0, 23481000.0),
 (datetime.datetime(2024, 4, 27, 15, 53, 28), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 27, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 10, 45804000.0, 16826000.0, 38976000.0),
 (datetime.datetime(2024, 4, 28, 15, 58, 58), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 28, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 5, 40094000.0, 8755000.0, 25432000.0),
 (datetime.datetime(2024, 4, 28, 12, 46, 47), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 28, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 4, 47249000.0, 37765000.0, 41091000.0),
 (datetime.datetime(2024, 5, 1, 16, 21, 25), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 7, 42240000.0, 11051000.0, 19125000.0),
 (datetime.datetime(2024, 5, 1, 13, 53, 47), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 3, 37572000.0, 19759000.0, 31972000.0),
 (datetime.datetime(2024, 5, 1, 11, 31, 37), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 9, 43137000.0, 19843000.0, 22344000.0),
 (datetime.datetime(2024, 5, 6, 15, 48, 41), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 6, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 10, 39516000.0, 14831000.0, 24290000.0),
 (datetime.datetime(2024, 5, 6, 19, 25, 24), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 6, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 5, 46495000.0, 10618000.0, 39340000.0)]

In [16]:
%sql SELECT user_id, rating, comment, heart_count FROM reviews LIMIT 10;

 * postgresql://postgres:***@localhost/SoleMateAI
10 rows affected.

[(UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 5, 'Giày đẹp lắm, chất lượng tuyệt vời.', 439),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 3, 'Giày tạm được nha shop.', 447),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 3, 'Giày tạm được nha shop.', 360),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 3, 'Giày tạm được nha shop.', 450),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 4, 'Giày đẹp chất lượng ổn.', 128),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 5, 'Giày đẹp lắm, chất lượng tuyệt vời.', 481),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 5, 'Giày đẹp lắm, chất lượng tuyệt vời.', 367),
 (UUID('47dc1b8c-f635-4256-9db1-6ba1df1b5477'), 4, 'Giày đẹp chất lượng ổn.', 295),
 (UUID('cfba2c23-abdf-46e6-85f6-0a8c2f03077a'), 4, 'Giày đẹp chất lượng ổn.', 237),
 (UUID('cfba2c23-abdf-46e6-85f6-0a8c2f03077a'), 3, 'Giày tạm được nha shop.', 246)]

#### knowledge base of chatbot

In [17]:
%sql WITH ranked_shoes AS ( \
    SELECT \
        sho.id AS shoe_id, \
        sho.shoe_name, \
        b.brand_name, \
        s.size_number, \
        c.color_name, \
        sho.discounted_price, \
        sp.promotion_id, \
        ROW_NUMBER() OVER (PARTITION BY sho.brand_id ORDER BY sho.id) AS rn \
    FROM \
        shoes AS sho \
    JOIN \
        brands AS b ON sho.brand_id = b.id \
    JOIN \
        sizes AS s ON sho.size_id = s.id \
    JOIN \
        colors AS c ON sho.color_id = c.id \
    LEFT JOIN \
        shoes_promotions AS sp ON sho.id = sp.shoe_id \
    WHERE \
        sho.deleted_at IS NULL \
        AND b.deleted_at IS NULL \
        AND s.deleted_at IS NULL \
        AND c.deleted_at IS NULL \
        AND sp.promotion_id IS NOT NULL \
) \
SELECT \
    rs.shoe_id, \
    rs.shoe_name, \
    rs.brand_name, \
    rs.size_number, \
    rs.color_name, \
    rs.discounted_price, \
    p.promotion_name, \
    p.start_date AS promotion_start_date, \
    p.end_date AS promotion_end_date, \
    p.discount_percent AS promotion_discount_percent \
FROM \
    ranked_shoes AS rs \
LEFT JOIN \
    promotions AS p ON rs.promotion_id = p.id AND p.deleted_at IS NULL \
WHERE \
    rs.rn <= 2;

 * postgresql://postgres:***@localhost/SoleMateAI
8 rows affected.

[(UUID('10a78df1-2c3d-4c1a-9650-1d56551b0054'), 'Nike Shoe Model Light Blue 41', 'Nike', 41, 'Light Blue', 1200000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('06fae8c8-f186-4aa3-b96a-fe42ac4d1e81'), 'Nike Shoe Model Red 40', 'Nike', 40, 'Red', 1200000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('3cf161be-b5e4-4ebe-9761-e3c8e66806e0'), 'Adidas Shoe Model Red 41', 'Adidas', 41, 'Red', 880000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('07f5e859-53dc-461b-9796-01f0a35faeb9'), 'Adidas Shoe Model Grey 40', 'Adidas', 40, 'Grey', 880000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('32f73d9f-0740-4974-a818-17593a73af9c'), 'Reebok Shoe Model Grey 40', 'Reebok', 40, 'Grey', 1170000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('2a6b4026-59f5-4015-ab32-0b3b624d1028'), 'Reebok Shoe Model Yellow 40', 'Reebok', 40, 'Yellow', 1800000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('40cd0d96-2b61-474a-8f60-ad7154951cb1'), 'Puma Shoe Model Grey 40', 'Puma', 40, 'Grey', 1530000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('385ad354-6b1c-4cb6-bb08-23495f77435c'), 'Puma Shoe Model Grey 41', 'Puma', 41, 'Grey', 1530000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10)]

#### get latest shoe

In [18]:
%sql \
SELECT  \
        sho.id AS shoe_id, \
        sho.shoe_name, \
        b.brand_name, \
        s.size_number, \
        c.color_name, \
        sho.discounted_price, \
        sho.created_at, \
        p.promotion_name, \
        p.start_date AS promotion_start_date, \
        p.end_date AS promotion_end_date, \
        p.discount_percent AS promotion_discount_percent \
    FROM  \
        shoes AS sho \
    JOIN  \
        brands AS b ON sho.brand_id = b.id \
    JOIN  \
        sizes AS s ON sho.size_id = s.id \
    JOIN  \
        colors AS c ON sho.color_id = c.id \
    LEFT JOIN  \
        shoes_promotions AS sp ON sho.id = sp.shoe_id \
    LEFT JOIN  \
        promotions AS p ON sp.promotion_id = p.id \
    WHERE  \
        sho.deleted_at IS NULL  \
        AND b.deleted_at IS NULL  \
        AND s.deleted_at IS NULL  \
        AND c.deleted_at IS NULL  \
    ORDER BY  \
        sho.created_at DESC \
    LIMIT 1;

 * postgresql://postgres:***@localhost/SoleMateAI
1 rows affected.

[(UUID('d2cbfbea-12df-4d9c-967e-16ee64999eeb'), 'Adidas test', 'Adidas', 0, 'Yellow', 950000.0, datetime.datetime(2024, 6, 10, 5, 48, 19, 453151, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None)]